// let a = "hello"
// let b = "Okten"
// let c = a.concat(b)
// console.log(c)
// concat(b)
// =======================================плюсуэ змини миж собою аналог +
//====================================================concat(b)================================================
// let d = a.toUpperCase()
// console.log(d)
//  let d = a.toUpperCase()
// =============================================перетворюэ з маленькои литери на велику
//====================================================toUpperCase()===========================================
// let a = "HELLO"
// let b = a.toLowerCase()
// console.log(b)
// ============================================перетворюэ з великои литери на маленьку
// ====================================================toLowerCase()===========================================
// let a = "hello"
// console.log(a.startsWith("h"))
// console.log(a.endsWith("o"))
// console.log(a.includes("el"))
//================================================ проверяэ слово за символами
//=============================================startsWith("h"),a.endsWith("o"),includes("el")==================
// let a = "hello"
// console.log(a.charAt(0))
//==================================веводить литеру з слова по индексу
//============================================== charAt(0)=====================================================
// let a = "hello"
// console.log(a.indexOf("l"))
// console.log(a.lastIndexOf("l"))
//==================================== виводить индекс по литери
//===================================== indexOf("l"),lastIndexOf("l")==========================================
// let a = "+38 (067)6363112"
// let b = a.replaceAll("+38"," ").replaceAll("(", " ").replaceAll(")", " ")
// console.log(b)
// ===============================миняэ символ в тексти з одного на иший ("1","2")
//=============================== replaceAll("+38"," "),replace(")", " ")======================================
// let a = "hello"
// let b = a.substring(0,3)
// console.log(b)
//================================= виризаэ символи з тексту з ([i] по [i])
//============================================substring(0,3)===================================================
// let usser = "1_vasya_pupkin_phone"
// let id = usser.split("_")
// console.log(id)
// let ussersBlock = {
//     id:id[0],
//     name:id[1],
//     sorsName:id[2],
//     phone: id[3]
// }
// console.log(ussersBlock)
//================== розподиляэ текст по символу пример split("_") та запаковуэ в масив
//===========================================split()==========================================================


//=============================================МАСИВИ=========================================================


// let a = []
// console.log(Array.isArray(a))
// if (typeof a === "object" && Array.isArray(a)){
//     console.log("це масив")
// }
//===================================== провиряэ чи це масив Array.isArray()
//============================================ Array.isArray(a)===============================================
// let a = []
// a.push(123)
// console.log(a)
//====================================== додаэ значеня в кинець масиву push()
//================================================a.push(123)==================================================
// let a = [231]
// a.unshift(123)
// console.log(a)
//====================================== додаэ значеня в початок масиву push()
//================================================a.unshift(123)==================================================
// let a = [31,21,21,12,2222]
// a.pop()
// console.log(a)
//=======================================видаляэ значеня з кинця масива pop()
//===================================================== pop()==================================================
// let a = [31,12,12,123,33,]
// a.shift()
// console.log(a)
//=======================================видаляэ значеня з початку масиву shift()
//===============================================shift()======================================================
// let a = [21,21,343,54,64,44]
// let b = a.join("_")
// console.log(b)
//===================================перетворюэ масив з всима елементами в строку join("_")
//=========================================== join("_")======================================================
// let a = [1,2,3]
// let b = [3,4,5]
// let c = a.concat(b)
// console.log(c)
//==========================================обэднюэ 2 масива в один concat()
//================================================ concat(b)==================================================
// let a = [21,12,112,1,212]
// let b = a.reverse()
// console.log(b)
//============================================реверсуэ масив reverse()
//====================================================reverse()==============================================
// let a = [21,21,12,3213,122]
// console.log(a.indexOf(12))
//===========================================показуэ индекс значеня indexOF
//====================================================indexOf(12)============================================
// let a = [ 12,21,21,323,555,45,89]
// let b = a.splice(0,2, "asdas","qweqwe")
// console.log(b)
//======================== виризаэ идекси з масива та заминяэ ишими splice(0,2, "asdas","qweqwe")
//===================================splice(0,2, "asdas","qweqwe")===========================================
// let a = ["hello"]
// console.log(a.includes("hello"))
//перевиряэ значеня масиву на обэкт Пр a.includes("hello") виводить тру якщо негативно то фолс
//===============================================includes("hello")============================================
let usser = [
    {title: 'JavaScript Complex', monthDuration: 5},
    {title: 'Java Complex', monthDuration: 6},
    {title: 'Python Complex', monthDuration: 6},
    {title: 'QA Complex', monthDuration: 4},
    {title: 'FullStack', monthDuration: 7},
    {title: 'Frontend', monthDuration: 4}
];
let filter = usser.filter((users) => {return users.monthDuration} )
console.log(filter)
//============================================= filter======================================================
//============================================ фильтруэ======================================================
usser.forEach((users) => {return  console.log(users)})
//============================================forEach()======================================================
// ========================================итеруэ масив
let map = usser.map((user,index)=>{
     user.id = index +1
    return user
} )
console.log(map)
//============================================ map==========================================================
console.log(usser.sort((a,b) => a.monthDuration - b.monthDuration ))
//================================================= sort======================================================
console.log(usser.find(value => value.monthDuration = 5 ))
// ======================================находе елемент в масиви find========================================
console.log(usser.every(value => typeof value.monthDuration === "number" ))
//   ===================================every провиряэ маси и виводе тру=====================================
console.log(usser.some(value => value.monthDuration === 4))
// ================================some провиряэ хочаб одне значеня тру виводе тру
let matrix = [1,2,3,[1,2,3,[1,2,3]]]
// let asd = matrix.flat(3)
// console.log(asd)
//====================================обэднуэ багато вимерни масиви в 1  flat
let asd = matrix.flatMap(value => value)
console.log(asd)
//=========================================== flaMap========================================================
// let  redus = usser.reduce((basket,user) =>{
//     basket[user.title] = user
//     return basket
// },{})
// console.log(redus)
// ============================================================================================================
console.log (usser.reduce((bascet,usser)=>{
    if(usser.monthDuration === 4){
        bascet.bascetTrue.push(usser);
    }
    else {
       bascet.bascetFolse.push(usser)
    }
    return bascet
},{bascetTrue:[], bascetFolse:[]}))



// let capitalize = (str) => {
//    return str.split(' ').map(word=>word.charAt(0).toUpperCase()+word.slice(1)).join(' ');
// };
// // let  x = "dfsdfsd"
// // let z = x[0].toUpperCase()+x.slice(1)
// // console.log(z)
// // - Створити функцію-валідатор для адрес електронної пошти. Перевірка повинна включати в себе
// //     :данні до знака равлика(@), наявність равлика, крапку яка знаходиться не меньше ніж на 2
// // символ далі після равлика, функція не чутлива до регістру (some@email.com,SOME@EMAIL.COM,some@EMAIL.com,
// // і тд - однакові значення)
// let someemail = "someemail@gmail.com"
// // indexOf("l"),lastIndexOf("l")
// let x = someemail.indexOf("@")
// let z = someemail.indexOf(".")
//
// console.log(x,z)
//  if (x !== 0 && x !== -1 && x+2 < z && z !==-1 ){
//      console.log(true)
//  }
